{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.17.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                256,
                256,
                3
              ],
              "dtype": "float32",
              "name": "input_1"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 2,
              "activation": "softmax",
              "use_bias": true
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            196608,
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            2
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}